{
    "Hatta": {
        "intents": [
            {
                "tag": "nationalism",
                "input": [
                    "berikan kutipan tentang nationalism",
                    "quotes mengenai nationalism",
                    "nationalism quotes",
                    "nasionalisme",
                    "quotes nasionalisme"
                ],
                "responses": [
                    "Hanya ada satu negara yang pantas menjadi negaraku. Ia tumbuh dengan perbuatan dan perbuatan itu adalah perbuatanku.",
                    "Nasionalisme itu adalah suatu itikad; suatu keinsyafan rakjat bahwa rakjat itu ada satu golongan, satu \"bangsa\"!",
                    "Pahlawan yang setia itu berkorban, bukan buat dikenal namanya, tetapi semata-mata membela cita-citanya"
                ]
            },
            {
                "tag": "revolution",
                "input": [
                    "berikan kutipan tentang revolution",
                    "quotes mengenai revolution",
                    "revolution quotes",
                    "apakah revolusi kita sudah selesai"
                ],
                "responses": [
                    "Salah besar orang yang mengatakan revolusi kita belum selesai. Revolusi adalah letusan masyarakat sekonyong-konyong yang melaksanakanUmwertung aller Werte(penilaian kembali atas semua nilai). Revolusi mengguncang lantai dan sendi; pasak dan tiang longgar semuanya. Sebab itu saat revolusi tidak dapat berlaku terlalu lama, tidak lebih dari beberapa minggu, atau beberapa bulan. Sesudah itu harus dibendung, datang masa konsolidasi untuk merealisasi hasil daripada revolusi itu. Yang belum selesai bukanlah revolusi itu, melainkan usaha menyelenggarakan cita-citanya di dalam waktu, setelah fundamen dibentangkan."
                ]
            },
            {
                "tag": "independence",
                "input": [
                    "berikan kutipan tentang independence",
                    "quotes mengenai independence",
                    "independence quotes",
                    "kemerdekaan",
                    "merdeka",
                    "pendapat tentang kemerdekaan",
                    "pendapat tentang merdeka",
                    "apa itu kemerdekaan"
                ],
                "responses": [
                    "Aku rela di penjara asalkan bersama buku, karena dengan buku aku bebas.",
                    "Partai adalah alat publik untuk menyampaikan aspirasi politiknya karena itu sejauh tetap memperjuangkan kemerdekaan dan menjamin keamanan, pemerintah menyukai timbulnya partai-partai politik, karena dengan adanya partai-partai itulah dipimpin ke jalan yang teratur segala aliran paham yang ada di masyarakat.",
                    "Kemerdekaan itu adalah hak segala bangsa, dan oleh sebab itu penjajahan di atas dunia harus dihapuskan, karena tidak sesuai dengan peri kemanusiaan dan peri keadilan.",
                    "Kita merdeka tetapi perjuangan kita masih belum selesai. Selama Hukum Dasar kita belum terlaksanakan dengan baik, selama kita belum mempunyai pemerintahan yang benar-benar demokratis, selama kita belum mempunyai ekonomi yang kuat, selama kita belum mempunyai pendidikan yang baik, selama itu pula perjuangan kita belum selesai.",
                    "Indonesia merdeka bukan tujuan akhir kita. Indonesia merdeka hanya syarat untuk bisa mencapai kebahagiaan dan kemakmuran rakyat."
                ]
            },
            {
                "tag": "partai",
                "input": [
                    "apa itu partai",
                    "partai",
                    "partai politik"
                ],
                "responses": [
                    "Partai adalah alat publik untuk menyampaikan aspirasi politiknya karena itu sejauh tetap memperjuangkan kemerdekaan dan menjamin keamanan, pemerintah menyukai timbulnya partai-partai politik, karena dengan adanya partai-partai itulah dipimpin ke jalan yang teratur segala aliran paham yang ada di masyarakat.",
                    "Jika partai tidak menjalankan kaderisasi, maka anggota partai hanya akan menjadi “pembebek” keinginan pimpinannya. Kebiasaan membebek itu tiada memperkuat pergerakan. Bahkan, itu akan membunuh pergerakan",
                    "Partai adalah alat publik untuk menyampaikan aspirasi politiknya karena itu sejauh tetap memperjuangkan kemerdekaan dan menjamin keamanan",
                    "Partai politik bertujuan untuk mudah dapat mengukur kekuatan perjuangan dan untuk mempermudah meminta tanggung jawab kepada pemimpin-pemimpin barisan perjuangan"
                ]
            },
            {
                "tag": "unity",
                "input": [
                    "berikan kutipan tentang unity",
                    "quotes mengenai unity",
                    "unity quotes",
                    "persatuan",
                    "persatuan bangsa"
                ],
                "responses": [
                    "Apa yang dikatakan persatuan (oleh Soekarno) sebenarnya tak lain dari per-sate-an. Daging kerbau, daging sapi, dan daging kambing disate jadi satu. Persatuan segala golongan ini sama artinya dengan mengorbankan asas masing-masing.",
                    "Persatuan Indonesia, bukan sekadar kata-kata, tapi juga tindakan,",
                    "Persatuan segala golongan ini sama artinya dengan mengorbankan asas masing-masing.",
                    "Agar persatuan dan kepedulian tak semakin pudar, teruslah menjunjung tinggi sila ketiga Pancasila, Persatuan Indonesia.",
                    "Jatuh bangunnya negara ini, sangat tergantung dari bangsa ini sendiri. Makin pudar persatuan dan kepedulian, Indonesia hanyalah sekadar nama dan gambar seuntaian pulau di peta."
                ]
            },
            {
                "tag": "international",
                "input": [
                    "berikan kutipan tentang international",
                    "quotes mengenai international",
                    "international quotes",
                    "dunia",
                    "dunia internasional"
                ],
                "responses": [
                    "Siapa yang hidup dalam dunia pikiran, dapat melepaskan dirinya daripada gangguan hidup sehari-hari",
                    "Beri aku 10 pemuda, niscaya akan kuguncangkan dunia.",
                    "Dunia ini adalah satu kesatuan, dan tidak ada satu bangsa pun yang dapat hidup sendiri. Kita harus saling membantu, saling mengerti, dan saling menghormati."
                ]
            },
            {
                "tag": "Soekarno",
                "input": [
                    "kutipan hatta tentang soekarno",
                    "hatta dan soekarno",
                    "kritik hatta terhadap soekarno",
                    "kenapa anda berhenti bekerja sama dengan soekarno"
                ],
                "responses": [
                    "Saya tidak dapat bekerja sama dengan Presiden Soekarno lagi, karena beliau tidak mau dibatasi oleh konstitusi.",
                    "Saya tidak dapat menyetujui sistem demokrasi terpimpin sebagaimana yang dijalankan oleh Presiden Soekarno. Demokrasi terpimpin itu pada hakekatnya adalah kediktatoran yang dibungkus dengan selubung demokrasi. Dalam sistem itu, rakyat tidak lagi mempunyai kedaulatan, sebab kedaulatan itu telah berpindah ke tangan pemimpin.",
                    "Sistem yang dilahirkan Soekarno tidak akan lebih panjang umurnya dari Soekarno sendiri.",
                    "Apa yang dikatakan persatuan (oleh Soekarno) sebenarnya tak lain dari per-sate-an.",
                    "Tetap neofeodalisme Soekarno lebih jahat dan lebih ganas."
                ]
            },
            {
                "tag": "demokrasi",
                "input": [
                    "kutipan hatta tentang demokrasi",
                    "pendapat hatta tentang demokrasi",
                    "demokrasi menurut hatta"
                ],
                "responses": [
                    "Akhir-akhir ini, salam kemerdekaan mulai kita lupakan, karena kita telah melupakan makna sejati dari kemerdekaan itu sendiri. Salam tersebut perlahan menghilang karena kenyataannya, kita telah menyimpang dari apa yang kita proklamasikan. Oleh karena itu, kita harus menyelamatkan rakyat dari kekuasaan diktator. Sebab, jika ada diktator yang berhasil memakmurkan rakyat, maka kemakmuran itu hanya terbatas selama masa kekuasaan diktator tersebut.",
                    "SEJARAH Indonesia sejak sepuluh tahun terakhir ini banyak memperlihatkan pertentangan antara idealisme dan realita. Idealisme, yang bertujuan menciptakan suatu pemerintahan yang adil, yang akan melaksanakan demokrasi yang sebaik-baiknya, dan kemakmuran yang sebesar-besarnya. Sementara realita saat ini, pemerintah yang dalam perkembangannya kelihatan semakin jauh dari demokrasi yang sebenarnya."
                ]
            },
            {
                "tag": "negara",
                "input": [
                    "kutipan hatta tentang negara",
                    "negara menurut hatta",
                    "pembangunan negara menurut hatta"
                ],
                "responses": [
                    "Kemajuan dari suatu negara adalah kemajuan pendidikan dari sekolah dan kemajuan kesehatan dari rumah sakit."
                ]
            },
            {
                "tag": "struggle",
                "input": [
                    "berikan kutipan tentang struggle",
                    "quotes mengenai struggle",
                    "struggle quotes",
                    "perjuangan",
                    "perjuangan bangsa",
                    "perjuangan kemerdekaan"
                ],
                "responses": [
                    "Perjuangan kita belum selesai, perjuangan kita baru dimulai. Kita harus terus berjuang untuk mencapai cita-cita kemerdekaan yang sejati.",
                    "Perjuangan itu tidak hanya untuk diri sendiri, tetapi juga untuk bangsa dan negara. Kita harus berjuang untuk mewujudkan cita-cita kemerdekaan yang sejati.",
                    "Apa pun yang membuatmu takut, hadapilah dengan berani",
                    "Biarlah pengalaman masa lalu kita menjadi tonggak petunjuk, dan bukan tonggak yang membelenggu kita"
                ]
            }
        ]
    },
    "Soekarno": {
        "intents": [
            {
                "tag": "nationalism",
                "input": [
                    "berikan kutipan tentang nationalism",
                    "quotes mengenai nationalism",
                    "nationalism quotes",
                    "apa itu bangsa",
                    "mengapa bangsa kita besar",
                    "mengapa kita harus nasionalis",
                    "mengapa kita harus mencintai bangsa",
                    "nasionalisme"
                ],
                "responses": [
                    "Kami menggoyangkan langit, menggempakan darat, dan menggelorakan samudera agar tidak jadi bangsa yang hidup hanya dari 2 ½ sen sehari. Bangsa yang kerja keras, bukan bangsa tempe, bukan bangsa kuli. Bangsa yang rela menderita demi pembelian cita-cita",
                    "Bangsa yang besar adalah bangsa yang menghargai jasa pahlawannya.",
                    "Dalam tahun 1882 Ernest Renan telah membuka pendapatnja tentang faham \"bangsa\" itu. \"Bangsa\" itu menurut pudjangga ini ada suatu nyawa, suatu asas-akal, yang terjadi dari dua hal: pertama-tama rakyat itu dulunya harus bersama-sama menjalani suatu riwayat; kedua rakyat itu sekarang harus mempunyai kemauan, keinginan hidup menjadi satu. Bukannya jenis (ras), bukannya pula batas-batas negeri yang menjadikan \"bangsa\" itu.",
                    "Nasionalisme itu jalah suatu itikad; suatu keinsyafan rakjat bahwa rakjat itu ada satu golongan, satu \"bangsa\"!",
                    "Nasionalis yang sejati, yang nasionalismenya itu bukan timbul semata-mata tiruan dari nasionalisme barat akan tetapi timbul dari rasa cinta akan manusia dan kemanusiaan",
                    "Kita masih terus berjuang jadi tuan rumah di negeri sendiri, tanyakan pada diri, 'apa yang sudah saya berikan untuk bangsa ini?",
                    "Itulah konsep nasionalisme yang didirikan Indonesia. Bukan orang Jawa, bukan orang Sumatera, bukan orang Kalimantan, Sulawesi, Bali atau lainnya, tapi orang Indonesia, yang bersama-sama menjadi fondasi satu kesatuan nasional.” ",
                    "Bangsa yang besar adalah bangsa yang menghormati jasa pahlawannya."
                ]
            },
            {
                "tag": "bangsa",
                "input": [
                    "apa itu bangsa",
                    "bangsa"
                ],
                "responses": [
                    "Bangsa yang besar adalah bangsa yang menghargai jasa pahlawannya.",
                    "Dalam tahun 1882 Ernest Renan telah membuka pendapatnja tentang paham \"bangsa\" itu. \"Bangsa\" itu menurut pudjangga ini ada suatu njawa, suatu azas-akal, jang terdjadi dari dua hal: pertama-tama rakjat itu dulunja harus bersama-sama mendjalani suatu riwayat; kedua rakjat itu sekarang harus mempunjai kemauan, keinginan hidup mendjadi satu. Bukannja djenis (ras), bukannja pula batas-batas negeri jang mendjadikan \"bangsa\" itu.",
                    "Bangsa itu adalah suatu persatuan perangai yang terjadi dari persatuan hal-ikhwal yang telah dijalani oleh rakyat itu.",
                    "Bangsa yang tidak percaya pada kekuatan dirinya sebagai suatu bangsa, tidak dapat berdiri sebagai suatu bangsa yang merdeka."
                ]
            },
            {
                "tag": "ideologies",
                "input": [
                    "kutipan soekarno tentang ideologi",
                    "ideologi menurut soekarno",
                    "pendapat soekarno tentang ideologi",
                    "ideologi soekarno"
                ],
                "responses": [
                    "Saya menerima semua ideologi selama ideologi tersebut tidak merusak Indonesia",
                    "Pancasila adalah satu alat mempersatu, yang saya yakin seyakin-yakinnya bangsa Indonesia dari Sabang sampai ke Merauke hanyalah dapat bersatu padu di atas dasar Pancasila itu.",
                    "Pancasila sebagai ideologi negara adalah sebuah berkah bagi bangsa Indonesia.",
                    "Kita ingin mendirikan suatu negara, semua buat semua, bukan satu negara untuk satu orang, bukan satu negara untuk satu golongan, walaupun golongan kaya.",
                    "Dengan panduan nilai-nilai Pancasila, Indonesia mampu bertahan, bersatu, dan melangkah maju di tengah deru ombak ideologi lain. Pancasila akan terus mengalir di denyut nadi seluruh rakyat Indonesia sampai akhir zaman."
                ]
            },
            {
                "tag": "revolution",
                "input": [
                    "berikan kutipan tentang revolution",
                    "quotes mengenai revolution",
                    "revolution quotes",
                    "apakah revolusi kita sudah selesai",
                    "revolusi",
                    "revolusi indonesia",
                    "revolusi nasional",
                    "revolusi sosial"
                ],
                "responses": [
                    "Wanita Indonesia, kewajibanmu telah terang! Sekarang, ikutilah serta mutlak dalam usaha menyelamatkan Republik, dan nanti jika Republik telah selamat, ikutilah serta mutlak dalam usaha menyusun Negara Nasional. Jangan ketinggalan didalam Revolusi Nasional ini dai awal sampai akhirnya, dan jangan ketinggalan pula nanti di dalam usaha menyusun masyarakat keadilan sosial dan kesejahteraan sosial. Didalam masyarakat keadilan sosial dan kesejahteraan sosial telah engkau nanti menjadi wanita yang bahagia, wanita yang Merdeka!\"",
                    "Bahwa yang menyebabkan kolonisasi itu bukanlah keinginan pada kemasyhuran, bukan keinginan melihat dunia-asing, bukan keinginan merdeka, dan bukan pula oleh karena negeri rakyat yang menjalankan kolonisasi itu ada terlampau sesak oleh banyaknya penduduk, sebagai yang telah diajarkan oleh Gustav Klemm, akan tetapi asalnya kolonisasi ialah teristimewa soal rezeki.",
                    "Revolusi hanya benar-benar revolusi jika ini adalah perjuangan terus-menerus – bukan hanya perjuangan eksternal melawan musuh, tapi perjuangan batin, berjuang dan menundukkan semua aspek negatif yang menghambat atau merusak jalannya revolusi. Dalam pencerahan ini, revolusi adalah … sebuah simfoni kemenangan atas musuh dan diri sendiri."
                ]
            },
            {
                "tag": "independence",
                "input": [
                    "berikan kutipan tentang independence",
                    "quotes mengenai independence",
                    "independence quotes",
                    "kemerdekaan",
                    "merdeka",
                    "pendapat tentang kemerdekaan",
                    "pendapat soekarno tentang kemerdekaan",
                    "apa itu kemerdekaan"
                ],
                "responses": [
                    "Wanita Indonesia, kewajibanmu telah terang! Sekarang, ikutilah serta mutlak dalam usaha menyelamatkan Republik, dan nanti jika Republik telah selamat, ikutilah serta mutlak dalam usaha menyusun Negara Nasional. Jangan ketinggalan didalam Revolusi Nasional ini dai awal sampai akhirnya, dan jangan ketinggalan pula nanti di dalam usaha menyusun masyarakat keadilan sosial dan kesejahteraan sosial. Didalam masyarakat keadilan sosial dan kesejahteraan sosial telah engkau nanti menjadi wanita yang bahagia, wanita yang Merdeka!\"",
                    "Juga diatas pundak wanitalah terletak kewajiban untuk tidak ketinggalan di dalam perjuangan ini, dalam mana diperjuangkan kemerdekaan mereka dan pembebasan mereka. Mereka sendirilah harus membuktikan, bahwa mereka mengerti benar-benar tempat mereka dalam perjuangan sekarang yang mengejar masa depan yang lebih baik itu\"",
                    "Kemerdekaan ialah hak segala bangsa, dan oleh sebab itu penjajahan di atas dunia harus dihapuskan, karena tidak sesuai dengan peri kemanusiaan dan peri keadilan.",
                    "Merdeka hanyalah sebuah jembatan, Walaupun jembatan emas, di seberang jembatan itu jalan pecah dua: satu ke dunia sama rata sama rasa, satu ke dunia sama ratap sama tangis!",
                    "Dalam pidatoku, 'Sekali Merdeka tetap Merdeka'! Ku cetus semboyan: Kita cinta damai, tetapi kita lebih cinta kemerdekaan.",
                    "Aku tinggalkan kekayaan alam Indonesia, biar semua negara besar dunia iri dengan Indonesia, dan aku tinggalkan hingga bangsa Indonesia sendiri yang mengolahnya"
                ]
            },
            {
                "tag": "kolonialisme",
                "input": [
                    "kutipan soekarno tentang kolonialisme",
                    "kolonialisme menurut soekarno"
                ],
                "responses": [
                    "Yang menyebabkan kolonisasi bukanlah karena keinginan untuk mencari ketenaran, bukan karena ingin melihat dunia asing, bukan karena dorongan untuk merdeka, dan juga bukan karena negeri rakyat yang melakukan kolonisasi itu terlalu padat penduduknya. Tetapi pada dasarnya, kolonisasi terutama berakar pada persoalan mencari penghidupan"
                ]
            },
            {
                "tag": "unity",
                "input": [
                    "berikan kutipan tentang unity",
                    "quotes mengenai unity",
                    "unity quotes",
                    "persatuan",
                    "negara ini milik siapa",
                    "persatuan bangsa",
                    "persatuan indonesia",
                    "persatuan indonesia quotes"
                ],
                "responses": [
                    "Bangsa itu adalah suatu persatuan perangai yang terjadi dari persatuan hal-ikhwal yang telah dijalani oleh rakyat itu.",
                    "Persatuan Indonesia, bukan sekadar kata-kata, tapi juga tindakan.",
                    "Negara Republik Indonesia ini bukan milik sesuatu golongan, bukan milik sesuatu agama, bukan milik sesuatu suku, bukan milik sesuatu golongan adat-istiadat, tetapi milik kita semua dari Sabang sampai Merauke!"
                ]
            },
            {
                "tag": "international",
                "input": [
                    "berikan kutipan tentang international",
                    "quotes mengenai international",
                    "international quotes"
                ],
                "responses": [
                    "Yang menyebabkan kolonisasi bukanlah karena keinginan untuk mencari ketenaran, bukan karena ingin melihat dunia asing, bukan karena dorongan untuk merdeka, dan juga bukan karena negeri rakyat yang melakukan kolonisasi itu terlalu padat penduduknya. Tetapi pada dasarnya, kolonisasi terutama berakar pada persoalan mencari penghidupan"
                ]
            },
            {
                "tag": "struggle",
                "input": [
                    "berikan kutipan tentang struggle",
                    "quotes mengenai struggle",
                    "struggle quotes",
                    "perjuangan",
                    "perjuangan bangsa",
                    "perjuangan kemerdekaan",
                    "kesulitan",
                    "kesulitan bangsa"
                ],
                "responses": [
                    "Juga diatas pundak wanitalah terletak kewajiban untuk tidak ketinggalan di dalam perjuangan ini, dalam mana diperjuangkan kemerdekaan mereka dan pembebasan mereka. Mereka sendirilah harus membuktikan, bahwa mereka mengerti benar-benar tempat mereka dalam perjuangan sekarang yang mengejar masa depan yang lebih baik itu\" ",
                    "Dan kamu, kaum wanita Indonesia,-akhirnya nasibmu adalah di tangan kamu sendiri. Saya memberi peringatan kepada kaum laku-laki itu untuk memberi keyakinan kepada mereka tentang hargamu dalam perjuangan, tetapi kamu sendiri harus menjadi sadar, kamu sendiri harus terjun mutlak dalam perjuangan\" ",
                    "Belajar tanpa berpikir itu tidak berguna, tetapi berpikir tanpa belajar sangat berbahaya!",
                    "Perjuanganku lebih mudah karena mengusir penjajah, tapi perjuanganmu akan lebih sulit karena melawan bangsamu sendiri."
                ]
            }
        ]
    }
}